---
kind: method
id: M:Autodesk.Revit.DB.STLExportOptions.IsValidForNormalTolerance(System.Double)
source: html/59e7201f-9248-4b5f-8db7-b6d7a5326367.htm
---
# Autodesk.Revit.DB.STLExportOptions.IsValidForNormalTolerance Method

Checks whether the value is allowed (is in the allowed range) for NormalTolerance tessellation parameter.

## Syntax (C#)
```csharp
public static bool IsValidForNormalTolerance(
	double value
)
```

## Parameters
- **value** (`System.Double`) - The value to be checked.

## Returns
True if the value is valid for NormalTolerance, false otherwise.